In [2]:
import pandas as pd 
import numpy as np

In [31]:
s = pd.Series([12,100,12,None],index=['a','b','c','d'])

#针对元素 对s的每一个元素是不是在括号里面的东西
s.isin([12])
# s.notnull() #series
# s[s.notnull()]
# s[s.isnull()]

a     True
b    False
c     True
d    False
dtype: bool

In [81]:
s[s.notnull().to_list()]

a     12
b    100
c     12
d      9
dtype: int64

In [71]:
print(s[2])

12

/var/folders/80/31xnfltj5xd4l8pxg8vly4zw0000gn/T/ipykernel_41688/3674811518.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(s[2])

In [72]:
data = {'color':['white','red','black'],'items':['ball','pen','pencil'],'price':[2.5,1.5,0.6]}
frame = pd.DataFrame(data)
frame

   color   items  price
0  white    ball    2.5
1    red     pen    1.5
2  black  pencil    0.6

In [73]:
frame2 = pd.DataFrame(data,columns=['items','price'])
frame2

    items  price
0    ball    2.5
1     pen    1.5
2  pencil    0.6

In [74]:
frame = {'red':{2012:22,2014:45},'green':{2008:23,2012:22,2014:17},'blue':{2008:18,2012:28,2014:19}}
frame = pd.DataFrame(frame)
frame

       red  green  blue
2012  22.0     22    28
2014  45.0     17    19
2008   NaN     23    18

In [75]:
a = frame.T 
a.columns #列名，不可以单个修改

Index([2012, 2014, 2008], dtype='int64')

In [76]:
a.index = [1,'black',3] #  行名
a

       2012  2014  2008
1      22.0  45.0   NaN
black  22.0  17.0  23.0
3      28.0  19.0  18.0

In [77]:
a[2012] #先列后行

1        22.0
black    22.0
3        28.0
Name: 2012, dtype: float64

In [78]:
a.loc[1]

2012    22.0
2014    45.0
2008     NaN
Name: 1, dtype: float64

In [79]:
print(type(a[2012]))

<class 'pandas.core.series.Series'>

In [93]:
frame = {'red':{2012:22,2014:45},'green':{2008:23,2012:22,2014:17},'blue':{2008:18,2012:28,2014:19}}
frame = pd.DataFrame(frame)
frame.index.name = 'gegezuiaixiaonvhai'
frame.to_csv('./gege.csv',encoding='utf-8')

In [94]:
data = pd.read_csv('gege.csv',index_col= 'gegezuiaixiaonvhai')
data

                     red  green  blue
gegezuiaixiaonvhai
2012                22.0     22    28
2014                45.0     17    19
2008                 NaN     23    18

In [95]:
data.index.name = None
data

       red  green  blue
2012  22.0     22    28
2014  45.0     17    19
2008   NaN     23    18

In [97]:
frame = {'red':{2012:22,2014:45},'green':{2008:23,2012:22,2014:17},'blue':{2008:18,2012:28,2014:19}}
frame = pd.DataFrame(frame)
# frame.index.name = 'gegezuiaixiaonvhai'
frame.to_csv('./gege.csv',encoding='utf-8',index=False)
data = pd.read_csv('gege.csv')
data

    red  green  blue
0  22.0     22    28
1  45.0     17    19
2   NaN     23    18

In [107]:
# frame.to_csv('gege1.csv')
# data1 = pd.read_csv('gege1.csv',index_col='Unnamed: 2')
data2 = pd.read_table('gege.csv',sep=',')
data2

    red  green  blue
0  22.0     22    28
1  45.0     17    19
2   NaN     23    18

In [142]:
# frame.to_csv('gege2.py',sep='*')
pd.read_csv('gege1.csv',sep=',',index_col='Unnamed: 0').to_csv('gege3.csv',index=False)
pd.read_csv('gege.csv')

    red  green  blue
0  22.0     22    28
1  45.0     17    19
2   NaN     23    18

In [143]:
pd.read_csv('gege.csv',skiprows=[0,2])

   22.0  22  28
0   NaN  23  18

In [1]:
import pandas as pd

data = pd.DataFrame({
    '姓名': ['张三', '李四', '王五'],
    '成绩': [85, 92, 78],
    '性别': ['男', '男', '女']
})
data

   姓名  成绩 性别
0  张三  85  男
1  李四  92  男
2  王五  78  女

In [ ]:
print(data.loc[1]) #按行名取值

姓名    李四
成绩    92
性别     男
Name: 1, dtype: object

In [ ]:
print(data.loc[1,'成绩']) #取出第二行成绩那一列
print(data.loc[:,'姓名'])
print(data.loc[0:1,['姓名','成绩']]) ############

92
0    张三
1    李四
2    王五
Name: 姓名, dtype: object
   姓名  成绩
0  张三  85
1  李四  92

In [10]:
# .loc[行名, 列名]	按标签取	data.loc[1, '成绩']
# .iloc[行号, 列号]	按位置取	data.iloc[1, 1]

In [13]:
print([data.iloc[1,1]]) #从0开始
print(data.iloc[0,0])

[np.int64(92)]
张三

In [16]:
import numpy as np
frame2 = pd.DataFrame(np.random.rand(9).reshape(3,3),index=[4,5,6],columns=['A','B','C'])
frame2

          A         B         C
4  0.058956  0.212297  0.062911
5  0.330668  0.664903  0.630088
6  0.119727  0.853731  0.275506

In [17]:
ser1 = pd.Series(np.random.rand(5),index=[1,2,3,4,5])
ser1

1    0.588681
2    0.728791
3    0.262815
4    0.087601
5    0.490679
dtype: float64

In [18]:
ser2 = pd.Series(np.random.rand(4),index=[2,4,5,6])
ser2

2    0.055537
4    0.737495
5    0.743782
6    0.625559
dtype: float64

In [19]:
ser1.combine_first(ser2)

1    0.588681
2    0.728791
3    0.262815
4    0.087601
5    0.490679
6    0.625559
dtype: float64

In [21]:
frame = pd.DataFrame({'color':['white','red','green','red','green'],
                      'object':['pen','pencil','pencil','ashtray','pen'],
                      'price1':[5.56,4.20,1.34,5.32,2.32],
                      'price2':[1.43,2.43,4.53,6.53,5.35]})
frame

   color   object  price1  price2
0  white      pen    5.56    1.43
1    red   pencil    4.20    2.43
2  green   pencil    1.34    4.53
3    red  ashtray    5.32    6.53
4  green      pen    2.32    5.35

In [ ]:
group = frame['price1'].groupby(frame['color']) #注意这里的group是行索引
group.groups

{'green': [2, 4], 'red': [1, 3], 'white': [0]}

In [25]:
group.mean()

color
green    1.83
red      4.76
white    5.56
Name: price1, dtype: float64

In [26]:
group.sum()

color
green    3.66
red      9.52
white    5.56
Name: price1, dtype: float64

In [27]:
ggroup = frame['price1'].groupby([frame['color'],frame['object']])

In [28]:
ggroup.groups

{('green', 'pen'): [4], ('green', 'pencil'): [2], ('red', 'ashtray'): [3], ('red', 'pencil'): [1], ('white', 'pen'): [0]}

In [29]:
ggroup.sum()

color  object
green  pen        2.32
       pencil     1.34
red    ashtray    5.32
       pencil     4.20
white  pen        5.56
Name: price1, dtype: float64

In [30]:
frame[['price1','price2']].groupby(frame['color']).mean()

       price1  price2
color
green    1.83    4.94
red      4.76    4.48
white    5.56    1.43